sdaiAddModel(Sdai_instS*,Sdai_instS*)
\details
Adds a model to a specified schema instance.
\param schemaInstance [in] A schema instance.
\param model          [in] A model to be added.
\remarks
This function is not implemented yet.
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiSI_NEXS - Schema instance does not exist.
* sdaiRP_NOPN - Repository is not open.
* sdaiRP_NEXS - Repository does not exist.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiMO_NDEQ - SDAI-model not domain equivalent.
* sdaiVT_NVLD - Name value type is invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.